#2) შექმენით პროგრამა while ციკლის საშვალებით რომელიც გამოთვლის ყველა ნატურალური რიცხვის ჯამს 1-იდან 50-მდე\

#num=0

#while num > 50:
    #num = num + 1
    #print(num)


    #3) შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) მანამდე სანამ არ შეიყვანს 1234-ს
#pin= 1234

#password=int(input("enter your password: "))

#if password == pin:
   #print(1234)
#else:
   #print("inccorect")

#4) შექმნით რიცხვის გამოცნობის თამაში while ციკლით, რომელიც მომხმარებელს შეეკითხება რიცხვს 1-დან 10-მდე, სანამ მომხმარებელი არ შეიყვანს თქვენთვის სასურველ რიცხვს

#num=7

#num1=int(input("guess number: "))
#while num > 10:
    #print(num)
#if num1 == num:
    #print("correct")
#else:
    #print("incorecct")

#5) ტექსტურ ფაილში ახსენით როდის ვიყენებთ while ციკლს და როდის for ციკლს

#for ციკლს ვიყენებთ მაშინ თუ ვიცით კონკრეტული რიცხვი და while ციკლს ვიყენებთ  როდესაც არ ვიცით



