#1) შექმენით სია შემდგარი მინიმუმ 5 ელემენტისგან. წაუშალეთ ამ სიას ბოლო ორი ელემენტი და დაბეჭდეთ ის

#names=[23, 34, 56, 876, 345]
#print(names[0:3])


#2) შექმენით ცვლადი, სადაც შეინახავთ სთრინგს. slicing-ის მეშვეობით დაბეჭდეთ ის უკუღმა

#surnames=["kakhadze", "koncelidze", "labadze", "beridze", "azarovi"]
#surnames.reverse()
#print(surnames)

#3) შექმენით რიცხვების სია შემგარი 10 მინიმუმ ელემენტისგან. გაიგეთ ამ სიაში ყველაზე პატარა და დიდი რიცხვი, შემდეგ კი დაბეჭდეთ მათი ჯამი


#numbers = [23, 5, 12, 67, 45, 89, 34, 21, 78, 11]


#smallest = min(numbers)
#largest = max(numbers)

#sum_of_extremes = smallest + largest

#4) შექმენით ცვლადი სადაც შეინახავთ სთრინგს და გაიგეთ,
#  არის თუ არა ის პალინდრომი(პალინდრომი არის ისეთი სიტყვა, რომელიც ორივე მხრიდან ერთნაირად იკითხება, მაგალითად, "ana"...)
#name="anna"
#if name == name[::-1]:
    #print("its palindrom")
#else:
    #print("its not palindrom")


#5) შექმენით რიცხვების სია, გადაუარეთ მას for loop-ით, გაიგეთ რამდენი ლუწი და რამდენი კენტი რიცხვი გვაქვს სიაში და დაბეჭდეთ მათი რაოდენობა

##numbers = [1,2,3,4,5,6,7,8,9,10,12]

#even_count = 0
#odd_count = 0

#for number in numbers:
        #if number % 2 == 0:
                #3even_count += 1
        #else:
               ##odd_count += 1


#print("Even numbers count:", even_count)
#print("Odd numbers count:", odd_count)



#6) შექმენით სია, სადაც გექნებათ 1-ანები და 0-ანები, შექმენით ახალი სია, რომელიც თავიდან იქნება ცარიელი. for loop-ით გადაუარეთ პირველ სიას და თუ საიტერაციო ცვლადის მნიშვნელობა იქნება 1, ახალ სიაში ჩაამატეთ True, სხვა შემთხვევაში False. საბოლოოდ დაბეჭდეთ ახალი სია












