#2) შექმენით ფუნქცია,
#  რომელსაც არგუმენტად გადაეცემა სახელი და დაბეჭდავს მისთვის მიესალმებას (მაგალითად: "Hello Nika"). გამოძახეთ ეს ფუნქცია 2-ჯერ და გადაეცით სხვადასხვა სახელი
def greet(name):
    print("Hello " + name)


greet("Nika")
greet("Alex")


#3) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა 2 რიცხვი. ფუნქციამ უნდა დაბეჭდოს ამ რიცხვების ნამრავლი. საბოლოოდ გამოიძახეთ ის

def multiply(num1, num2):
    sum = num1 * num2
    print(sum)


multiply(3, 4)


#4) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა სია. ფუნქციამ უნდა დაბეჭდოს ეს სია შებრუნებულად(არ გამოიყენოთ slicing-ი)
def list_revrse(list):

    for i in range(len(list) - 1, -1, -1):
        print(list[i])

list_revrse([1, 2, 3, 4, 5])



#5)შექმენით ფუნქცია, რომელსაც გადასცემთ რიცხვების სიას. გადაუარეთ გადმოცემულ სიას for ციკლით და დააბრუნეთ ახალი სია, სადაც ჩამატებული 
#იქნება გადმოცემული სიიდან მხოლოდ ის რიცხვები, რომლებიც მეტია 10-ზე. საბოლოოდ დააბრუნეთ ეს სია



#6) შექმენით ფუნქცია, რომელსაც გადაეცემა სიმბოლოების სია. ფუნქციამ უნდა დააბრუნოს ეს სია პირველი და ბოლო ელემენტების გარეშე, გამოიყენეთ slicing-ი

def remove_first_and_last(characters):
    return characters[1:-1]


result = remove_first_and_last(['a', 'b', 'c', 'd', 'e'])
print(result)


#7) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვების სია,
# გადაურეთ ორივეს for ციკლით და გაიგეთ თითოეულ სიაში რიცხვების ჯამი(შეინახეთ ცალკე ცვლადებში), გაამრავლეთ ორივე ერთმანეთზე და დააბრუნეთ




#8) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია. გადაუარეთ ამ სიას while ციკლით და ჩაამატეთ გაორმაგებული რიცხვები ახალ სიაში. საბოლოოდ დააბრუნეთ ეს სია


#9) შექმენით ფუნქცია, რომელსაც გადაეცემა რიცხვების სია. გადაუარეთ ამ სიას for ციკლით და ჩაამატეთ მხოლოდ ლუწი რიცხვები ახალ სიაში. საბოლოოდ დააბრუნეთ ეს სია
def filter_even_numbers(numbers):
    result = []

    for number in numbers:
        if number % 2 == 0:  
            result.append(number)

    return result

print(filter_even_numbers([1, 2, 3, 4, 5, 6]))


#10) შექმენით ფუნქცია, რომელსაც გადაეცემა სახელების სია. 
#შექმენით ახალის სია, სადაც ჩაამატებთ გადმოცემული სიიდან მხოლოდ იმ სახელებს, რომლებიც იწყება "N"-ზე`. საბოლოოდ დააბრუნეთ ეს სია
def filter_names_starting_with_n(names):
    result = []

    for name in names:
        if name.startswith("N"):  
            result.append(name)

    return result


print(filter_names_starting_with_n(["Nika", "Alice", "Nora", "Bob", "Nick"]))

