#1) შექმენით სია, რომელსაც შეინახავთ ცვლადში სახელად friends. მაგ სიაში უნდა შეინახოთ მინიმუმ 5 მეგობრის სახელი. პირველ რიგში გამოიტანეთ თქვენი საუკეთესო მეგობრის სახელი ინდექსების დახმარებით. დაბეჭდეთ სია. შეცვლაეთ მე-3 ინდექსზე მყოფი სახელი ახალით და დაბეჭდეთ სია. საბოლოოდ დაბეჭდეთ მთლიანი სიის სიგრძე


#friend = [ "nika", "lika", "luka", "gio", "lile" ]
#print(friend [1])
#print(friend)
#friend[3] = "saba"
#print(friend)
#print(len(friend))

#2) შექმენით მანქანების სია, სადაც გამოიყენებთ ერთ-ერთ ფუნქციას, რომ სიაში დაამატოთ ახალი მანქანა.
#ეხლით არ უნდა ჩაწეროთ!!!



#cars=["bmw", "bugati", "ferrari", "nissan", "toyota"]

#cars.append("amg")
#print(cars)



#3) შექმენით რიცხვების სია სადაც გექნებათ მინიმუმ ხუთი რიცხვი. შეცვლაეთ ამ სიის პირველი ელემენტი და გაუტოლეთ ის 50-ს. შემდეგ კი გამოიტანეთ სიიდან პირველი და ბოლო რიცხვის ჯამი


nums=[1, 2, 3, 4, 5]
nums[1]=50
print(nums)

print (nums[0] + nums[4])


